In [33]:
import pandas as pd
import numpy as np

Creating a data frame from a list of lists. Each inner list represents one row. Column names are taken positionally.

In [34]:
df = pd.DataFrame([
    [10,20,30,40],
    [50,60,70,80],
    [90,100,110,120]],
    index=list('xyz'),
    columns=list('abcd'))
df

    a    b    c    d
x  10   20   30   40
y  50   60   70   80
z  90  100  110  120

 Creating a data frame from a list of dicts. `Each dict is a row`, and `the keys indicate column values`.

In [35]:
df = pd.DataFrame([
    {'a': 10, 'b': 20, 'c': 30, 'd': 40},
    {'a': 50, 'b': 60, 'c': 70, 'd': 80},
    {'a': 90, 'b': 100, 'c': 110, 'd':120}],
    index = list('xyz'))
df

    a    b    c    d
x  10   20   30   40
y  50   60   70   80
z  90  100  110  120

Pass a dict of list, Each key represents one column, and the values (lists) are each column's values.

In [36]:
df = pd.DataFrame(
    {
        'a': [10, 50, 90],
        'b': [20, 60, 100],
        'c': [30, 70, 110],
        'd': [40, 80, 120]
    }
, index= list('xyz'))
df

    a    b    c    d
x  10   20   30   40
y  50   60   70   80
z  90  100  110  120

Pass a two-dimensional NumpyArray

In [37]:
df = pd.DataFrame(
    np.random.randint(0, 10, [3,4]),
    columns = list('abcd'),
    index = list('xyz')
)
df

   a  b  c  d
x  5  6  0  0
y  7  6  2  2
z  9  7  8  9

In [38]:
df = pd.DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500, 
                 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,
                'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,
                'retail_price':5, 'sales':300},
               ])

df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0          1000    100
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500
3          15          banana              0.5             1    200
4          87        sandwich              3.0             5    300

In [59]:
sales_total = (df['retail_price'] - df['wholesale_price']) * df['sales']
sales_total

0    50000.0
1    40000.0
2    20000.0
3      100.0
4      600.0
dtype: float64

In [40]:
total = ((df['retail_price'] - df['wholesale_price']) * df['sales']).sum()
total

np.float64(110700.0)

### Beyond the exercise

For what products is the retail price more than twice the wholesale price?

In [57]:
df['name'][df['retail_price'] / 2 > df['wholesale_price']]

1    Python Workout
2    Pandas Workout
Name: name, dtype: object

How much did the store make from food versus computers versus books? (You can retrieve based on the index values, not anything more sophisticated.)

In [60]:
food_total = sales_total[[3,4]].sum()
computers_total = sales_total[0]
books_total = sales_total.loc[1:2].sum()

In [61]:
print(f'food: ${food_total :.3f}, computers: ${computers_total :.3f}, books: ${books_total :.2f}')

food: $700.000, computers: $50000.000, books: $60000.00

In [62]:
print(f'Pertcentages: food: {food_total/total :.4f}, computers: {computers_total/total :.4f}, books: {books_total/total :.4f}')

Pertcentages: food: 0.0063, computers: 0.4517, books: 0.5420

Because your store is doing so well, you can negotiate a 30% discount on the wholesale price of goods. Calculate the new net income.

In [63]:
(df['retail_price'] - (df['wholesale_price'] * 0.70)) * df['sales']

0    65000.0
1    50500.0
2    25250.0
3      130.0
4      870.0
dtype: float64

In [64]:
((df['retail_price'] - (df['wholesale_price'] * 0.70)) * df['sales']).sum()

np.float64(141750.0)